tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"

brew "bash"
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "git-delta"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lf"
brew "mise"
brew "neovim"
brew "nvm"
brew "pass"
brew "poppler"
brew "postgresql@14"
brew "powerlevel10k"
brew "python@3.13"
brew "ripgrep"
brew "sevenzip"
brew "spotify_player"
brew "stow"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "typescript"
brew "watchman"
brew "yarn"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "nikitabobko/tap/aerospace"
cask "brave-browser"
cask "claude-code"
cask "font-maple-mono-nf"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "raycast"
cask "thebrowsercompany-dia"
cask "ghostty"
cask "wezterm"
