tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"

brew "awscli"
brew "bash"
brew "bat"
brew "btop"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "git-delta"
brew "helix"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lf"
brew "mise"
brew "neovim"
brew "nvm"
brew "pass"
brew "poppler"
brew "postgresql@14"
brew "powerlevel10k"
brew "python@3.13"
brew "ripgrep"
brew "sevenzip"
brew "spotify_player"
brew "stow"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "typescript"
brew "watchman"
brew "yarn"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"

cask "nikitabobko/tap/aerospace"
cask "aws-vault-binary"
cask "brave-browser"
cask "claude-code"
cask "figma"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "keepassxc"
cask "medis"
cask "microsoft-teams"
cask "raycast"
cask "spotify"
cask "thebrowsercompany-dia"
cask "visual-studio-code"
cask "wezterm"
cask "zen"
cask "zoom"

vscode "asvetliakov.vscode-neovim"
vscode "avetis.tokyo-night"
vscode "be5invis.vscode-custom-css"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "charles-sanford.scss-block-comments"
vscode "christian-kohler.path-intellisense"
vscode "codevars.platzi-theme-for-vs-code"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "heybourn.headwind"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "nick-rudenko.back-n-forth"
vscode "ofhumanbondage.react-proptypes-intellisense"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
